{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "account_access",
    "1": "billing_issue",
    "2": "cancellation_request",
    "3": "general_feedback",
    "4": "product_inquiry",
    "5": "technical_support"
  },
  "initializer_range": 0.02,
  "label2id": {
    "account_access": 0,
    "billing_issue": 1,
    "cancellation_request": 2,
    "general_feedback": 3,
    "product_inquiry": 4,
    "technical_support": 5
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.5.4",
  "use_cache": false,
  "vocab_size": 30522
}
